# NoBarSizeWarning Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarCouplerFailures..::..NoBarSizeWarning Property
BuiltInFailures..::..RebarCouplerFailures Class See Also
---
This is used to post warning. At least Bar Size 1 or Bar Size 2 should have a value other than "None".
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId NoBarSizeWarning { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NoBarSizeWarning As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ NoBarSizeWarning {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarCouplerFailures Class
Autodesk.Revit.DB Namespace